cmsis-svd/cmsis-svd/data/NXP/LPC1102_4_v4.xml
			</field>									
			<field>									
				<name>GPIO</name>								
				<description>Enables clock for GPIO.</description>								
				<bitRange>[6:6]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLE</name>						
						<description>Disable</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLE</name>						
						<description>Enable</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>CT16B0</name>								
				<description>Enables clock for 16-bit counter/timer 0.</description>								
				<bitRange>[7:7]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLE</name>						
						<description>Disable</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLE</name>						
						<description>Enable</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>CT16B1</name>								
				<description>Enables clock for 16-bit counter/timer 1.</description>								
				<bitRange>[8:8]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLE</name>						
						<description>Disable</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLE</name>						
						<description>Enable</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>CT32B0</name>								
				<description>Enables clock for 32-bit counter/timer 0.</description>								
				<bitRange>[9:9]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLE</name>						
						<description>Disable</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLE</name>						
						<description>Enable</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>CT32B1</name>								
				<description>Enables clock for 32-bit counter/timer 1.</description>								
				<bitRange>[10:10]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLE</name>						
						<description>Disable</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLE</name>						
						<description>Enable</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>SSP0</name>								
				<description>Enables clock for SPI0.</description>								
				<bitRange>[11:11]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLE</name>						
						<description>Disable</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLE</name>						
						<description>Enable</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>UART</name>								
				<description>Enables clock for UART.</description>								
				<bitRange>[12:12]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLE</name>						
						<description>Disable</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLE</name>						
						<description>Enable</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>ADC</name>								
				<description>Enables clock for ADC.</description>								
				<bitRange>[13:13]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLE</name>						
						<description>Disable</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLE</name>						
						<description>Enable</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[14:14]</bitRange>								
											
			</field>									
			<field>									
				<name>WDT</name>								
				<description>Enables clock for WDT.</description>								
				<bitRange>[15:15]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLE</name>						
						<description>Disable</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLE</name>						
						<description>Enable</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>IOCON</name>								
				<description>Enables clock for I/O configuration block.</description>								
				<bitRange>[16:16]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLE</name>						
						<description>Disable</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLE</name>						
						<description>Enable</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[31:17]</bitRange>								
											
