cmsis-svd/cmsis-svd/data/NXP/LPC1102_4_v4.xml
			</field>									
		</fields>										
	</register>											
	<register>											
		<name>SYSTCKCAL</name>										
		<description>System tick counter calibration</description>										
		<addressOffset>0x154</addressOffset>										
		<access>read-write</access>										
		<resetValue>0x004</resetValue>										
		<resetMask>0xFFFFFFFF</resetMask>										
		<fields>										
			<field>									
				<name>CAL</name>								
				<description>System tick timer calibration value</description>								
				<bitRange>[25:0]</bitRange>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[31:26]</bitRange>								
			</field>									
		</fields>										
	</register>											
	<register>											
		<name>STARTAPRP0</name>										
		<description>Start logic edge control register 0</description>										
		<addressOffset>0x200</addressOffset>										
		<access>read-write</access>										
		<resetValue>0</resetValue>										
		<resetMask>0x00000000</resetMask>										
		<fields>										
			<field>									
				<name>APRPIO0_0</name>								
				<description>Edge select for start logic input PIO0_0</description>								
				<bitRange>[0:0]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>FALLING_EDGE</name>						
						<description>Falling edge</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>RISING_EDGE</name>						
						<description>Rising edge</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[7:1]</bitRange>								
											
			</field>									
			<field>									
				<name>APRPIO0_8</name>								
				<description>Edge select for start logic input PIO0_8</description>								
				<bitRange>[8:8]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>FALLING_EDGE</name>						
						<description>Falling edge</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>RISING_EDGE</name>						
						<description>Rising edge</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>APRPIO0_9</name>								
				<description>Edge select for start logic input PIO0_9</description>								
				<bitRange>[9:9]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>FALLING_EDGE</name>						
						<description>Falling edge</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>RISING_EDGE</name>						
						<description>Rising edge</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>APRPIO0_10</name>								
				<description>Edge select for start logic input PIO0_10</description>								
				<bitRange>[10:10]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>FALLING_EDGE</name>						
						<description>Falling edge</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>RISING_EDGE</name>						
						<description>Rising edge</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>APRPIO0_11</name>								
				<description>Edge select for start logic input PIO0_11</description>								
				<bitRange>[11:11]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>FALLING_EDGE</name>						
						<description>Falling edge</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>RISING_EDGE</name>						
						<description>Rising edge</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>APRPIO1_0</name>								
				<description>Edge select for start logic input PIO1_0.</description>								
				<bitRange>[12:12]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>FALLING_EDGE</name>						
						<description>Falling edge</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>RISING_EDGE</name>						
						<description>Rising edge</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[31:13]</bitRange>								
											
			</field>									
		</fields>										
	</register>											
	<register>											
		<name>STARTERP0</name>										
		<description>Start logic signal enable register 0</description>										
		<addressOffset>0x204</addressOffset>										
		<access>read-write</access>										
		<resetValue>0</resetValue>										
		<resetMask>0x00000000</resetMask>										
		<fields>										
			<field>									
				<name>ERPIO0_0</name>								
				<description>Enable start signal for start logic input PIO0_0</description>								
				<bitRange>[0:0]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLED</name>						
						<description>Disabled</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLED</name>						
						<description>Enabled</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[7:1]</bitRange>								
											
