cmsis-svd/cmsis-svd/data/NXP/LPC1102_4_v4.xml
			</field>									
			<field>									
				<name>ERPIO0_8</name>								
				<description>Enable start signal for start logic input PIO0_8</description>								
				<bitRange>[8:8]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLED</name>						
						<description>Disabled</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLED</name>						
						<description>Enabled</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>ERPIO0_9</name>								
				<description>Enable start signal for start logic input PIO0_9</description>								
				<bitRange>[9:9]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLED</name>						
						<description>Disabled</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLED</name>						
						<description>Enabled</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>ERPIO0_10</name>								
				<description>Enable start signal for start logic input PIO0_10</description>								
				<bitRange>[10:10]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLED</name>						
						<description>Disabled</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLED</name>						
						<description>Enabled</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>ERPIO0_11</name>								
				<description>Enable start signal for start logic input PIO0_11</description>								
				<bitRange>[11:11]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLED</name>						
						<description>Disabled</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLED</name>						
						<description>Enabled</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>ERPIO1_0</name>								
				<description>Enable start signal for start logic input PIO1_0</description>								
				<bitRange>[12:12]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLED</name>						
						<description>Disabled</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLED</name>						
						<description>Enabled</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Do not set reserved bits in this register to one.</description>								
				<bitRange>[31:13]</bitRange>								
											
			</field>									
		</fields>										
	</register>											
	<register>											
		<name>STARTRSRP0CLR</name>										
		<description>Start logic reset register 0</description>										
		<addressOffset>0x208</addressOffset>										
		<access>write-only</access>										
		<resetValue>0</resetValue>										
		<resetMask>0x00000000</resetMask>										
		<fields>										
			<field>									
				<name>RSRPIO0_0</name>								
				<description>Start signal reset for start logic input PIO0_0</description>								
				<bitRange>[0:0]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>_</name>						
						<description>RESERVED</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>WRITE_RESET_START_S</name>						
						<description>Write: reset start signal</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[7:1]</bitRange>								
											
			</field>									
			<field>									
				<name>RSRPIO0_8</name>								
				<description>Start signal reset for start logic input PIO0_8</description>								
				<bitRange>[8:8]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>_</name>						
						<description>RESERVED</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>WRITE_RESET_START_S</name>						
						<description>Write: reset start signal</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RSRPIO0_9</name>								
				<description>Start signal reset for start logic input PIO0_9</description>								
				<bitRange>[9:9]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>_</name>						
						<description>RESERVED</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>WRITE_RESET_START_S</name>						
						<description>Write: reset start signal</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RSRPIO0_10</name>								
				<description>Start signal reset for start logic input PIO0_10</description>								
				<bitRange>[10:10]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>_</name>						
						<description>RESERVED</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>WRITE_RESET_START_S</name>						
						<description>Write: reset start signal</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RSRPIO0_11</name>								
				<description>Start signal reset for start logic input PIO0_11</description>								
				<bitRange>[11:11]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>_</name>						
						<description>RESERVED</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>WRITE_RESET_START_S</name>						
						<description>Write: reset start signal</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RSRPIO1_0</name>								
				<description>Start signal reset for start logic input PIO1_0</description>								
				<bitRange>[12:12]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>_</name>						
						<description>RESERVED</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>WRITE_RESET_START_S</name>						
						<description>Write: reset start signal</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[31:13]</bitRange>								
											
