cmsis-svd/cmsis-svd/data/NXP/LPC1102_4_v4.xml
			</field>									
		</fields>										
	</register>											
	<register>											
		<name>STARTSRP0</name>										
		<description>Start logic status register 0</description>										
		<addressOffset>0x20C</addressOffset>										
		<access>read-only</access>										
		<resetValue>0</resetValue>										
		<resetMask>0x00000000</resetMask>										
		<fields>										
			<field>									
				<name>SRPIO0_0</name>								
				<description>Start signal status for start logic input 0PIO0_0</description>								
				<bitRange>[0:0]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NO_START_SIGNAL_RECE</name>						
						<description>No start signal received</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>START_SIGNAL_PENDING</name>						
						<description>Start signal pending</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[7:1]</bitRange>								
											
			</field>									
			<field>									
				<name>SRPIO0_8</name>								
				<description>Start signal status for start logic input PIO0_8</description>								
				<bitRange>[8:8]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NO_START_SIGNAL_RECE</name>						
						<description>No start signal received</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>START_SIGNAL_PENDING</name>						
						<description>Start signal pending</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>SRPIO0_9</name>								
				<description>Start signal status for start logic input PIO0_9</description>								
				<bitRange>[9:9]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NO_START_SIGNAL_RECE</name>						
						<description>No start signal received</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>START_SIGNAL_PENDING</name>						
						<description>Start signal pending</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>SRPIO0_10</name>								
				<description>Start signal status for start logic input PIO0_10</description>								
				<bitRange>[10:10]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NO_START_SIGNAL_RECE</name>						
						<description>No start signal received</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>START_SIGNAL_PENDING</name>						
						<description>Start signal pending</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>SRPIO0_11</name>								
				<description>Start signal status for start logic input PIO0_11</description>								
				<bitRange>[11:11]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NO_START_SIGNAL_RECE</name>						
						<description>No start signal received</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>START_SIGNAL_PENDING</name>						
						<description>Start signal pending</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>SRPIO1_0</name>								
				<description>Start signal status for start logic input PIO1_0</description>								
				<bitRange>[12:12]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NO_START_SIGNAL_RECE</name>						
						<description>No start signal received</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>START_SIGNAL_PENDING</name>						
						<description>Start signal pending</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved</description>								
				<bitRange>[31:13]</bitRange>								
											
			</field>									
		</fields>										
	</register>											
	<register>											
		<name>PDSLEEPCFG</name>										
		<description>Power-down states in Deep-sleep mode</description>										
		<addressOffset>0x230</addressOffset>										
		<access>read-write</access>										
		<resetValue>0x00000000</resetValue>										
		<resetMask>0xFFFFFFFF</resetMask>										
		<fields>										
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Always write these bits as 111.</description>								
				<bitRange>[2:0]</bitRange>								
											
			</field>									
			<field>									
				<name>BOD_PD</name>								
				<description>BOD power-down control in Deep-sleep mode, see Table 35.</description>								
				<bitRange>[3:3]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>POWERED</name>						
						<description>Powered</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>POWERED_DOWN</name>						
						<description>Powered down</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Always write these bits as 11.</description>								
				<bitRange>[5:4]</bitRange>								
											
